#### Terraform Plan `failure`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.github_user.mage-os-ci: Reading...
github_membership.users["gowrizrh"]: Refreshing state... [id=Mage-OS:gowrizrh]
github_team.teams["infrastructure"]: Refreshing state... [id=6847100]
github_team.teams["tech-lead"]: Refreshing state... [id=6847098]
github_team.teams["continuous-integration"]: Refreshing state... [id=8150814]
github_team.teams["async-events"]: Refreshing state... [id=7998296]
github_membership.users["wigman"]: Refreshing state... [id=Mage-OS:wigman]
github_membership.users["damienwebdev"]: Refreshing state... [id=Mage-OS:damienwebdev]
github_team.teams["content"]: Refreshing state... [id=6847102]
github_team.teams["distribution"]: Refreshing state... [id=6847101]
github_membership.users["johnhughes1984"]: Refreshing state... [id=Mage-OS:johnhughes1984]
github_membership.users["sprankhub"]: Refreshing state... [id=Mage-OS:sprankhub]
github_membership.users["DavidLambauer"]: Refreshing state... [id=Mage-OS:DavidLambauer]
github_membership.users["Vinai"]: Refreshing state... [id=Mage-OS:Vinai]
github_membership.users["mage-os-ci"]: Refreshing state... [id=Mage-OS:mage-os-ci]
github_membership.users["johnprendergast"]: Refreshing state... [id=Mage-OS:johnprendergast]
github_repository.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=mirror-magento-coding-standard]
github_repository.mirrors["mirror-magento-zend-loader"]: Refreshing state... [id=mirror-magento-zend-loader]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-magento-zend-db"]: Refreshing state... [id=mirror-magento-zend-db]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
data.github_user.mage-os-ci: Read complete after 4s [id=100189073]
github_repository.mirrors["mirror-magento-zend-cache"]: Refreshing state... [id=mirror-magento-zend-cache]
github_repository.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=mirror-commerce-operations.en]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_repository.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=mirror-magento2-functional-testing-framework]
github_repository.mirrors["mirror-PHPCompatibilityFork"]: Refreshing state... [id=mirror-PHPCompatibilityFork]
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_repository.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=mirror-commerce-admin.en]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-magento-zend-memory"]: Refreshing state... [id=mirror-magento-zend-memory]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-magento-zend-exception"]: Refreshing state... [id=mirror-magento-zend-exception]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-quality-patches"]: Refreshing state... [id=mirror-quality-patches]
github_repository.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=mirror-magento-cloud-patches]
github_repository.mirrors["mirror-magento-zend-log"]: Refreshing state... [id=mirror-magento-zend-log]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_repository.mirrors["mirror-magento-zend-pdf"]: Refreshing state... [id=mirror-magento-zend-pdf]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.repositories["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory]
github_repository.repositories["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_repository.repositories["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["devdocs-website"]: Refreshing state... [id=devdocs-website]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
github_repository.repositories["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception]
github_repository.repositories["devdocs"]: Refreshing state... [id=devdocs]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["mageos-composer"]: Refreshing state... [id=mageos-composer]
github_repository.repositories["mageos-common-async-events"]: Refreshing state... [id=mageos-common-async-events]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_repository.repositories["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache]
github_repository.repositories["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db]
github_repository.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js]
github_repository.repositories["meta"]: Refreshing state... [id=meta]
github_repository.repositories["terraform"]: Refreshing state... [id=terraform]
github_repository.repositories["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_repository.repositories["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf]
github_repository.repositories["github-actions"]: Refreshing state... [id=github-actions]
github_repository.repositories["mageos-async-events-admin-ui"]: Refreshing state... [id=mageos-async-events-admin-ui]
github_repository.repositories["mageos-async-events"]: Refreshing state... [id=mageos-async-events]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_repository.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_team_membership.members["wigman_content"]: Refreshing state... [id=6847102:wigman]
github_team_membership.members["mage-os-ci_continuous-integration"]: Refreshing state... [id=8150814:mage-os-ci]
github_team_membership.members["DavidLambauer_content"]: Refreshing state... [id=6847102:DavidLambauer]
github_team_membership.members["Vinai_distribution"]: Refreshing state... [id=6847101:Vinai]
github_team_membership.members["sprankhub_infrastructure"]: Refreshing state... [id=6847100:sprankhub]
github_team_membership.members["DavidLambauer_infrastructure"]: Refreshing state... [id=6847100:DavidLambauer]
github_team_membership.members["Vinai_tech-lead"]: Refreshing state... [id=6847098:Vinai]
github_team_membership.members["gowrizrh_async-events"]: Refreshing state... [id=7998296:gowrizrh]
github_team_membership.members["damienwebdev_distribution"]: Refreshing state... [id=6847101:damienwebdev]
github_team_membership.members["Vinai_infrastructure"]: Refreshing state... [id=6847100:Vinai]
github_team_membership.members["johnhughes1984_content"]: Refreshing state... [id=6847102:johnhughes1984]
github_team_membership.members["Vinai_content"]: Refreshing state... [id=6847102:Vinai]
github_team_membership.members["johnprendergast_content"]: Refreshing state... [id=6847102:johnprendergast]
github_team_membership.members["sprankhub_distribution"]: Refreshing state... [id=6847101:sprankhub]
github_team_membership.members["damienwebdev_infrastructure"]: Refreshing state... [id=6847100:damienwebdev]
github_branch_protection.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=BPR_kwDOH_yQpc4B1Gmt]
github_branch_protection.mirrors["mirror-magento-zend-exception"]: Refreshing state... [id=BPR_kwDOJ6bTUc4CWSNZ]
github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=BPR_kwDOG3Rr984By-dH]
github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOG1y7C84By-d5]
github_branch_protection.mirrors["mirror-adobe-ims"]: Refreshing state... [id=BPR_kwDOG8FV-s4By-dL]
github_branch_protection.mirrors["mirror-magento-zend-log"]: Refreshing state... [id=BPR_kwDOJ6bT_84CWSNc]
github_branch_protection.mirrors["mirror-magento-zend-db"]: Refreshing state... [id=BPR_kwDOJ6bNj84CWSNa]
github_branch_protection.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=BPR_kwDOJIrSxM4CGjIG]
github_branch_protection.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOG8FefM4By-dZ]
github_branch_protection.mirrors["mirror-magento2"]: Refreshing state... [id=BPR_kwDOGHBHCc4By-d4]
github_branch_protection.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=BPR_kwDOJpbVr84CQwEY]
github_branch_protection.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOGMKAG84By-dP]
github_branch_protection.mirrors["mirror-quality-patches"]: Refreshing state... [id=BPR_kwDOJIrSsM4CGjIE]
github_branch_protection.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOGMKCJ84By-dW]
github_branch_protection.mirrors["mirror-inventory"]: Refreshing state... [id=BPR_kwDOGMKBz84By-dN]
github_branch_protection.mirrors["mirror-page-builder-types"]: Refreshing state... [id=BPR_kwDOGMKFF84By-dc]
github_branch_protection.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=BPR_kwDOIIQUpM4By-eH]
github_branch_protection.mirrors["mirror-PHPCompatibilityFork"]: Refreshing state... [id=BPR_kwDOLS132M4CzHfT]
github_branch_protection.mirrors["mirror-magento-zend-loader"]: Refreshing state... [id=BPR_kwDOJ6bQOs4CWSNV]
github_branch_protection.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=BPR_kwDOJpbWgc4CQwEW]
github_branch_protection.mirrors["mirror-magento-zend-memory"]: Refreshing state... [id=BPR_kwDOJ6bUk84CWSNg]
github_branch_protection.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOG3Ro_84By-dJ]
github_branch_protection.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOG1y6y84By-df]
github_branch_protection.mirrors["mirror-zf1"]: Refreshing state... [id=BPR_kwDOGMKC6M4By-d2]
github_branch_protection.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOG8L6gs4By-eB]
github_branch_protection.mirrors["mirror-devdocs"]: Refreshing state... [id=BPR_kwDOGwaLE84By-dS]
github_branch_protection.mirrors["mirror-magento-zend-cache"]: Refreshing state... [id=BPR_kwDOJ6bSms4CWSNh]
github_branch_protection.mirrors["mirror-magento-zend-pdf"]: Refreshing state... [id=BPR_kwDOJ6bR184CWSNf]
github_branch_protection.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=BPR_kwDOH_yQXM4B1Gm0]
github_branch_protection.mirrors["mirror-composer"]: Refreshing state... [id=BPR_kwDOHynKTc4By-d9]
github_branch_protection.mirrors["mirror-security-package"]: Refreshing state... [id=BPR_kwDOGMKCY84By-d1]
github_branch_default.repositories["mageos-async-events"]: Refreshing state... [id=mageos-async-events]
github_team_repository.tech-lead["dev-env-gitpod"]: Refreshing state... [id=6847098:dev-env-gitpod]
github_team_repository.tech-lead["devdocs"]: Refreshing state... [id=6847098:devdocs]
github_team_repository.tech-lead["mageos-magento2"]: Refreshing state... [id=6847098:mageos-magento2]
github_team_repository.tech-lead["mageos-inventory"]: Refreshing state... [id=6847098:mageos-inventory]
github_team_repository.tech-lead["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=6847098:mageos-magento2-functional-testing-framework]
github_team_repository.tech-lead["infrastructure"]: Refreshing state... [id=6847098:infrastructure]
github_team_repository.tech-lead["github-actions"]: Refreshing state... [id=6847098:github-actions]
github_team_repository.tech-lead["mageos-magento-composer-installer"]: Refreshing state... [id=6847098:mageos-magento-composer-installer]
github_team_repository.tech-lead["mageos-magento2-page-builder"]: Refreshing state... [id=6847098:mageos-magento2-page-builder]
github_team_repository.tech-lead["generate-mirror-repo-js"]: Refreshing state... [id=6847098:generate-mirror-repo-js]
github_team_repository.tech-lead["mageos-magento-zend-loader"]: Refreshing state... [id=6847098:mageos-magento-zend-loader]
github_team_repository.tech-lead["mageos-magento-zend-log"]: Refreshing state... [id=6847098:mageos-magento-zend-log]
github_team_repository.tech-lead["mageos-composer"]: Refreshing state... [id=6847098:mageos-composer]
github_team_repository.tech-lead["mageos-adobe-stock-integration"]: Refreshing state... [id=6847098:mageos-adobe-stock-integration]
github_team_repository.tech-lead["mageos-common-async-events"]: Refreshing state... [id=6847098:mageos-common-async-events]
github_team_repository.tech-lead["mageos-async-events"]: Refreshing state... [id=6847098:mageos-async-events]
github_team_repository.tech-lead["terraform"]: Refreshing state... [id=6847098:terraform]
github_team_repository.tech-lead["mageos-inventory-composer-installer"]: Refreshing state... [id=6847098:mageos-inventory-composer-installer]
github_team_repository.tech-lead["mageos-magento-coding-standard"]: Refreshing state... [id=6847098:mageos-magento-coding-standard]
github_team_repository.tech-lead["mageos-magento-zend-cache"]: Refreshing state... [id=6847098:mageos-magento-zend-cache]
github_team_repository.tech-lead["mageos-async-events-admin-ui"]: Refreshing state... [id=6847098:mageos-async-events-admin-ui]
github_team_repository.tech-lead["meta"]: Refreshing state... [id=6847098:meta]
github_team_repository.tech-lead["mageos-composer-root-update-plugin"]: Refreshing state... [id=6847098:mageos-composer-root-update-plugin]
github_team_repository.tech-lead["mageos-commerce-data-export"]: Refreshing state... [id=6847098:mageos-commerce-data-export]
github_team_repository.tech-lead["mageos-PHPCompatibilityFork"]: Refreshing state... [id=6847098:mageos-PHPCompatibilityFork]
github_team_repository.tech-lead["mageos-magento-zend-memory"]: Refreshing state... [id=6847098:mageos-magento-zend-memory]
github_team_repository.tech-lead["mageos-magento-zend-exception"]: Refreshing state... [id=6847098:mageos-magento-zend-exception]
github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=6847098:mageos-composer-dependency-version-audit-plugin]
github_team_repository.tech-lead["mage-os-website"]: Refreshing state... [id=6847098:mage-os-website]
github_team_repository.tech-lead["devdocs-website"]: Refreshing state... [id=6847098:devdocs-website]
github_team_repository.tech-lead["mageos-security-package"]: Refreshing state... [id=6847098:mageos-security-package]
github_team_repository.tech-lead["namespace"]: Refreshing state... [id=6847098:namespace]
github_team_repository.tech-lead["mageos-magento-zend-db"]: Refreshing state... [id=6847098:mageos-magento-zend-db]
github_team_repository.tech-lead["mageos-magento2-sample-data"]: Refreshing state... [id=6847098:mageos-magento2-sample-data]
github_team_repository.tech-lead["mageos-magento-zend-pdf"]: Refreshing state... [id=6847098:mageos-magento-zend-pdf]
github_branch_protection.repositories["devdocs-website"]: Refreshing state... [id=BPR_kwDOJynfzM4CTsOX]
github_branch_protection.repositories["mage-os-website"]: Refreshing state... [id=BPR_kwDOGCTTT84BysLE]
github_branch_protection.repositories["dev-env-gitpod"]: Refreshing state... [id=BPR_kwDOIfCi6c4B3JNi]
github_branch_protection.repositories["infrastructure"]: Refreshing state... [id=BPR_kwDOGHBGY84BysK_]
github_branch_protection.repositories["mageos-magento-zend-memory"]: Refreshing state... [id=BPR_kwDOJ6brmc4CWSNw]
github_branch_protection.repositories["mageos-magento-zend-cache"]: Refreshing state... [id=BPR_kwDOJ6bobc4CWSN8]
github_branch_protection.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOISivQc4BzuWP]
github_branch_protection.repositories["mageos-magento-zend-log"]: Refreshing state... [id=BPR_kwDOJ6bqtc4CWSN_]
github_branch_protection.repositories["namespace"]: Refreshing state... [id=BPR_kwDOGIl6i84BysLC]
github_branch_protection.repositories["mageos-PHPCompatibilityFork"]: Refreshing state... [id=BPR_kwDOLS2pAs4CzHfd]
github_branch_protection.repositories["mageos-common-async-events"]: Refreshing state... [id=BPR_kwDOKQgu7s4CeAjA]
github_branch_protection.repositories["mageos-magento2"]: Refreshing state... [id=BPR_kwDOH66Nbs4BysK-]
github_branch_protection.repositories["meta"]: Refreshing state... [id=BPR_kwDOJIrS4M4CGjIK]
github_branch_protection.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOISiM084BzuWR]
github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOISiqV84BzuWX]
github_branch_protection.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=BPR_kwDOJpbZ9c4CQwEV]
github_branch_protection.repositories["devdocs"]: Refreshing state... [id=BPR_kwDOJyncx84CTsOc]
github_branch_protection.repositories["mageos-magento-zend-exception"]: Refreshing state... [id=BPR_kwDOJ6bph84CWSNs]
github_branch_protection.repositories["mageos-async-events-admin-ui"]: Refreshing state... [id=BPR_kwDOKQ7pMM4CeAi-]
github_branch_protection.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOISiZ3M4BzuWZ]
github_branch_protection.repositories["mageos-composer"]: Refreshing state... [id=BPR_kwDOJpba4M4CQwER]
github_branch_protection.repositories["mageos-magento-zend-loader"]: Refreshing state... [id=BPR_kwDOJ6bl9s4CWSN3]
github_branch_protection.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=BPR_kwDOJpbY-84CQwEP]
github_branch_protection.repositories["github-actions"]: Refreshing state... [id=BPR_kwDOJVdHWc4CK7Rj]
github_branch_protection.repositories["mageos-magento-zend-pdf"]: Refreshing state... [id=BPR_kwDOJ6bnL84CWSOJ]
github_branch_protection.repositories["mageos-commerce-data-export"]: Refreshing state... [id=BPR_kwDOISixH84BzuWN]
github_branch_protection.repositories["generate-mirror-repo-js"]: Refreshing state... [id=BPR_kwDOGta9mM4B0QmJ]
github_branch_protection.repositories["mageos-inventory"]: Refreshing state... [id=BPR_kwDOIShsYM4BzuWO]
github_branch_protection.repositories["mageos-security-package"]: Refreshing state... [id=BPR_kwDOIShpTM4BzuWV]
github_branch_protection.repositories["terraform"]: Refreshing state... [id=BPR_kwDOHNQe7c4BysLD]
github_branch_protection.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOISihV84BzuWa]
github_branch_protection.repositories["mageos-magento-zend-db"]: Refreshing state... [id=BPR_kwDOJ6bk1s4CWSN2]
github_branch_protection.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOISimRc4BzuWh]
github_branch_protection.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOISiVZc4BzuWM]
github_branch_protection.repositories["mageos-async-events"]: Refreshing state... [id=BPR_kwDOJIrSz84CGjIQ]
github_repository_file.codeowners["mage-os-website"]: Refreshing state... [id=mage-os-website/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/CODEOWNERS]
github_repository_file.codeowners["github-actions"]: Refreshing state... [id=github-actions/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory"]: Refreshing state... [id=mageos-inventory/CODEOWNERS]
github_repository_file.codeowners["devdocs-website"]: Refreshing state... [id=devdocs-website/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-admin-ui"]: Refreshing state... [id=mageos-async-events-admin-ui/CODEOWNERS]
github_repository_file.codeowners["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/CODEOWNERS]
github_repository_file.codeowners["mageos-security-package"]: Refreshing state... [id=mageos-security-package/CODEOWNERS]
github_repository_file.codeowners["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache/CODEOWNERS]
github_repository_file.codeowners["infrastructure"]: Refreshing state... [id=infrastructure/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/CODEOWNERS]
github_repository_file.codeowners["meta"]: Refreshing state... [id=meta/CODEOWNERS]
github_repository_file.codeowners["mageos-common-async-events"]: Refreshing state... [id=mageos-common-async-events/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard/CODEOWNERS]
github_repository_file.codeowners["devdocs"]: Refreshing state... [id=devdocs/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception/CODEOWNERS]
github_repository_file.codeowners["mageos-composer"]: Refreshing state... [id=mageos-composer/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2"]: Refreshing state... [id=mageos-magento2/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log/CODEOWNERS]
github_repository_file.codeowners["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events"]: Refreshing state... [id=mageos-async-events/CODEOWNERS]
github_repository_file.codeowners["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod/CODEOWNERS]
github_repository_file.codeowners["terraform"]: Refreshing state... [id=terraform/CODEOWNERS]
github_repository_file.codeowners["namespace"]: Refreshing state... [id=namespace/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf/CODEOWNERS]
github_repository_file.codeowners["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/CODEOWNERS]
github_branch_protection.repositories-release-please["github-actions"]: Refreshing state... [id=BPR_kwDOJVdHWc4Cgi74]
github_team_repository.teams["devdocs-website_infrastructure"]: Refreshing state... [id=6847100:devdocs-website]
github_team_repository.teams["namespace_infrastructure"]: Refreshing state... [id=6847100:namespace]
github_team_repository.teams["devdocs_content"]: Refreshing state... [id=6847102:devdocs]
github_team_repository.teams["meta_distribution"]: Refreshing state... [id=6847101:meta]
github_team_repository.teams["mageos-security-package_distribution"]: Refreshing state... [id=6847101:mageos-security-package]
github_team_repository.teams["mageos-magento2-sample-data_distribution"]: Refreshing state... [id=6847101:mageos-magento2-sample-data]
github_team_repository.teams["mageos-magento-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-magento-composer-installer]
github_team_repository.teams["meta_tech-lead"]: Refreshing state... [id=6847098:meta]
github_team_repository.teams["mageos-magento-zend-cache_distribution"]: Refreshing state... [id=6847101:mageos-magento-zend-cache]
github_team_repository.teams["dev-env-gitpod_infrastructure"]: Refreshing state... [id=6847100:dev-env-gitpod]
github_team_repository.teams["mageos-composer-root-update-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-root-update-plugin]
github_team_repository.teams["generate-mirror-repo-js_infrastructure"]: Refreshing state... [id=6847100:generate-mirror-repo-js]
github_team_repository.teams["mageos-magento-zend-exception_distribution"]: Refreshing state... [id=6847101:mageos-magento-zend-exception]
github_team_repository.teams["mageos-async-events-admin-ui_distribution"]: Refreshing state... [id=6847101:mageos-async-events-admin-ui]
github_team_repository.teams["mage-os-website_content"]: Refreshing state... [id=6847102:mage-os-website]
github_team_repository.teams["mageos-async-events_async-events"]: Refreshing state... [id=7998296:mageos-async-events]
github_team_repository.teams["mageos-PHPCompatibilityFork_distribution"]: Refreshing state... [id=6847101:mageos-PHPCompatibilityFork]
github_team_repository.teams["mageos-adobe-stock-integration_distribution"]: Refreshing state... [id=6847101:mageos-adobe-stock-integration]
github_team_repository.teams["mageos-inventory_distribution"]: Refreshing state... [id=6847101:mageos-inventory]
github_team_repository.teams["mageos-magento2_distribution"]: Refreshing state... [id=6847101:mageos-magento2]
github_team_repository.teams["meta_infrastructure"]: Refreshing state... [id=6847100:meta]
github_team_repository.teams["mageos-commerce-data-export_distribution"]: Refreshing state... [id=6847101:mageos-commerce-data-export]
github_team_repository.teams["mageos-async-events_distribution"]: Refreshing state... [id=6847101:mageos-async-events]
github_team_repository.teams["infrastructure_infrastructure"]: Refreshing state... [id=6847100:infrastructure]
github_team_repository.teams["mageos-inventory-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-inventory-composer-installer]
github_team_repository.teams["mageos-magento-coding-standard_distribution"]: Refreshing state... [id=6847101:mageos-magento-coding-standard]
github_team_repository.teams["mageos-magento-zend-loader_distribution"]: Refreshing state... [id=6847101:mageos-magento-zend-loader]
github_team_repository.teams["devdocs-website_content"]: Refreshing state... [id=6847102:devdocs-website]
github_team_repository.teams["mageos-magento-zend-db_distribution"]: Refreshing state... [id=6847101:mageos-magento-zend-db]
github_team_repository.teams["mageos-composer_distribution"]: Refreshing state... [id=6847101:mageos-composer]
github_team_repository.teams["meta_continuous-integration"]: Refreshing state... [id=8150814:meta]
github_team_repository.teams["terraform_infrastructure"]: Refreshing state... [id=6847100:terraform]
github_team_repository.teams["mageos-magento2-page-builder_distribution"]: Refreshing state... [id=6847101:mageos-magento2-page-builder]
github_team_repository.teams["mageos-magento-zend-pdf_distribution"]: Refreshing state... [id=6847101:mageos-magento-zend-pdf]
github_team_repository.teams["github-actions_infrastructure"]: Refreshing state... [id=6847100:github-actions]
github_team_repository.teams["mageos-async-events-admin-ui_async-events"]: Refreshing state... [id=7998296:mageos-async-events-admin-ui]
github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-dependency-version-audit-plugin]
github_team_repository.teams["mageos-magento-zend-log_distribution"]: Refreshing state... [id=6847101:mageos-magento-zend-log]
github_team_repository.teams["meta_content"]: Refreshing state... [id=6847102:meta]
github_team_repository.teams["devdocs_infrastructure"]: Refreshing state... [id=6847100:devdocs]
github_team_repository.teams["mageos-magento-zend-memory_distribution"]: Refreshing state... [id=6847101:mageos-magento-zend-memory]
github_team_repository.teams["mageos-common-async-events_async-events"]: Refreshing state... [id=7998296:mageos-common-async-events]
github_team_repository.teams["mageos-common-async-events_distribution"]: Refreshing state... [id=6847101:mageos-common-async-events]
github_team_repository.teams["mageos-magento2-functional-testing-framework_distribution"]: Refreshing state... [id=6847101:mageos-magento2-functional-testing-framework]
github_repository_file.merge-upstream-changes["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-composer"]: Refreshing state... [id=mageos-composer/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-inventory"]: Refreshing state... [id=mageos-inventory/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2"]: Refreshing state... [id=mageos-magento2/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-security-package"]: Refreshing state... [id=mageos-security-package/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory/.github/workflows/merge-upstream-changes.yml]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # github_branch_protection.mirrors["mirror-PHPCompatibilityFork"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = "R_kgDOLS132A"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_branch_protection.mirrors["mirror-data-migration-tool"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_branch_protection.repositories["mageos-PHPCompatibilityFork"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDOLS2pAs4CzHfd"
      ~ pattern                         = "develop" -> "*"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.mirrors["mirror-data-migration-tool"] will be created
  + resource "github_repository" "mirrors" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Mage-OS mirror fork of https://github.com/magento/data-migration-tool."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "mirror-data-migration-tool"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "adobecommerce",
          + "ecommerce",
          + "mage-os",
          + "magento",
          + "magento2",
          + "mirror",
          + "php",
        ]
      + visibility                  = (known after apply)
    }

  # github_team_repository.teams["meta_tech-lead"] will be updated in-place
  ~ resource "github_team_repository" "teams" {
        id         = "6847098:meta"
      ~ permission = "maintain" -> "push"
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

```

</details>

Issuer: @sprankhub, Action: https://github.com/mage-os/terraform/actions/runs/8332831047